01-FITS/Anatomy_of_a_FITS_file.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>The Flexible Image Transport System File Format</title>
<meta name="author" content="(Stuart Mumford)"/>
<link rel="stylesheet" href="../src/reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="../src/reveal.js/dist/theme/simple.css" id="theme"/>

<link rel="stylesheet" href="../org.css"/>
<link rel="stylesheet" href="../src/reveal.js/plugin/highlight/monokai.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide" data-background="../images/background_1.jpg"><h3>The Flexible Image Transport System File Format</h3>
<h4>Stuart Mumford</h4>
</section>

<section>
<section id="slide-org23cd328" data-background="../images/background_1.jpg">
<h2 id="org23cd328">A Breif History: aka "What do you mean only 8 characters"</h2>
<p>
FITS files have existed <b>since 1979</b>, with the first (single-HDU) version of the standard being published as a paper in 1981.
This first version of the standard was endorsed by the International Astronomical Union in 1982.
</p>

<p>
Each subsequent iteration of the FITS standard has maintained the mantra <i>"Once FITS, always FITS"</i> so each subsequent revision of the standard has to be backwards compatible with the last ones.
</p>

</section>
<section id="slide-org0af2ebf" data-background="../images/background_1.jpg">
<h3 id="org0af2ebf">Why Only 8 characters in the keywords?</h3>
<p>
Well FORTRAN 77 was formally adopted in 1978, one year before the first development of fits files.
So in a world where you had 8 characters for your variable names, you only needed 8 characters in your files as well.
</p>

</section>
</section>
<section>
<section id="slide-orga4562a9" data-background="../images/background_1.jpg">
<h2 id="orga4562a9">Some FITS milestones</h2>
<p>
(adapted from the 4.0 specification)
</p>

<ul>
<li><b>1979</b>: Initial use and interchange of FITS files.</li>
<li><b>1981</b>: Published original (single HDU) definition paper.</li>
<li><b>1982</b>: FITS format is formally endorsed by the IAU.</li>
<li><b>1988</b>: Defined rules for multiple HDUs in a FITS file.</li>
<li><b>1988</b>: FITS definition extended to include ASCII TABLE extensions.</li>
<li><b>1990</b>: FITS definition extended to include IEEE floating-point data.</li>
<li><b>1994</b>: FITS definition extended to multiple image arrays in IMAGE extensions.</li>
<li><b>1995</b>: FITS definition extended to binary tables in BINTABLE extensions.</li>
<li><b>2000</b>: Reiterated existing standard in one paper (FITS 2.0).</li>
<li><b>2002</b>: Approved conventions for generalized world coordinates and celestial coordinates.</li>
<li><b>2005</b>: Adopted conventions for spectral coordinate systems.</li>
<li><b>2005</b>: Included 64bit integer type.</li>
<li><b>2008</b>: FITS 3.0 Adopted by the IAU FITS Working Group.</li>
<li><b>2014</b>: Adopted proposals for Time coordinates.</li>
<li><b>2016</b>: FITS 4.0 Adopted by the IAU FITS Working Group, integrated WCS and other conventions into the standard.</li>

</ul>


</section>
</section>
<section>
<section id="slide-org9d98e30" data-background="../images/background_1.jpg">
<h2 id="org9d98e30">The anatomy of a FITS file</h2>
<ul>
<li>A FITS file is composed of <b>one or more</b> 2880 byte "FITS blocks".</li>
<li>Each file must be an integer multiple of 2880 bytes, there must be nothing between these blocks, they must follow each other.</li>
<li>The first 2880 byte block in the file must contain the start of the Primary HDU (back from when it was the <b>only</b> HDU).</li>
<li>Each HDU in the file must consist of at least one 2880 byte block of <b>header</b>.</li>

</ul>

</section>
<section id="slide-org521ae7c" data-background="../images/background_1.jpg">
<h3 id="org521ae7c">FITS File Layout</h3>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>PrimaryHDU Header Block 1</b></td>
<td class="org-left">2880 bytes</td>
</tr>

<tr>
<td class="org-left">More Header Blocks (optional)</td>
<td class="org-left">N 2880 byte blocks</td>
</tr>

<tr>
<td class="org-left">Data (optional)</td>
<td class="org-left">N 2880 byte blocks</td>
</tr>

<tr>
<td class="org-left">---</td>
<td class="org-left">---</td>
</tr>

<tr>
<td class="org-left"><b>HDU2 Header Block 1</b> (optional)</td>
<td class="org-left">2880 bytes</td>
</tr>

<tr>
<td class="org-left">More Header Blocks (optional)</td>
<td class="org-left">N 2880 byte blocks</td>
</tr>

<tr>
<td class="org-left">Data (optional)</td>
<td class="org-left">N 2880 byte blocks</td>
</tr>

<tr>
<td class="org-left">&#x2026;</td>
<td class="org-left">&#x2026;</td>
</tr>
</tbody>
</table>

</section>
<section id="slide-org9b1de73" data-background="../images/background_1.jpg">
<h3 id="org9b1de73">A FITS Header Card</h3>
<p>
Each header is divided up into 80 character long "cards", these cards contain the keyword, it's value and any comment.
</p>

<pre class="example" id="org71a54f8">
KKKKKKKK=␣VVVVVVVVVVVVVVVVVVVV␣/CCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC
|  key |  |     value        |  |               comment                        |
</pre>

<ul>
<li>The first 8 bytes are the keyword</li>
<li>byte 9 is the character <code>=</code></li>
<li>byte 10 is a space <code>␣</code></li>
<li>Bytes 11 through 80 are the value and optionally a comment.</li>

</ul>

<p>
If a comment is present it must be proceeded by a <code>/</code> and that slash <b>should</b> be proceeded by a space.
</p>

</section>
<section id="slide-org47f7732" data-background="../images/background_1.jpg">
<h3 id="org47f7732">A Minimal Single HDU File With Data</h3>
<div class="org-src-container">

<pre><code class="python" >import numpy as np
cards = [
    "SIMPLE  = T",
    "BITPIX  = -32",
    "NAXIS   = 2",
    "NAXIS1  = 10",
    "NAXIS2  = 10",
    "END"
    ]
header = "".join([c.ljust(80) for c in cards])
header = header.ljust(int(np.ceil(len(header) / 2880) * 2880))
header = header.encode('ascii')

print(header)
</code></pre>
</div>

</section>
<section id="slide-org553a9d1" data-background="../images/background_1.jpg">
<h4 id="org553a9d1">The Header</h4>
<pre class="example">
2880
b'SIMPLE  = T                                                                     BITPIX  = -32                                                                   NAXIS   = 2                                                                     NAXIS1  = 10                                                                    NAXIS2  = 10                                                                    END                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             '
</pre>


</section>
<section id="slide-orgd5b3b61" data-background="../images/background_1.jpg">
<h4 id="orgd5b3b61">Save the whole file</h4>
<div class="org-src-container">

<pre><code class="python" >data = np.zeros((10, 10)).astype("&gt;f")  # Big endian single precision float
data = data.tobytes().ljust(int(np.ceil(len(data) / 2880) * 2880))

with open("test.fits", "wb") as fobj:
    fobj.write(header)
    fobj.write(data)
</code></pre>
</div>

<div class="org-src-container">

<pre><code class="python" >from astropy.io import fits
hdul = fits.open("test.fits")
hdul.info()

print(hdul[0].data)
</code></pre>
</div>

<pre class="example" id="org20498da">
Filename: test.fits
No.    Name      Ver    Type      Cards   Dimensions   Format
  0  PRIMARY       1 PrimaryHDU       5   (10, 10)   float32   
[[0. 0. 0. 0. 0. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0. 0. 0. 0. 0. 0.]]
</pre>

</section>
<section id="slide-org386569d" data-background="../images/background_1.jpg">
<h4 id="org386569d">Reader</h4>
<pre class="example" id="orgea18ccf">
$ fitshdr test.fits 
================================================================================
FITS header number 1 at block number 1.
--------------------------------------------------------------------------------
SIMPLE  = T
BITPIX  = -32
NAXIS   = 2
NAXIS1  = 10
NAXIS2  = 10
END
--------------------------------------------------------------------------------
Data section number 1 beginning at block number 2.
Skipped 1 block of data of size 2880 bytes (2880 bytes).
================================================================================
End-of-file after 1 HDU in 2 x 2880-byte blocks (5760 bytes).
--------------------------------------------------------------------------------
</pre>
</section>
</section>
</div>
</div>
<script src="../src/reveal.js/dist/reveal.js"></script>
<script src="../src/reveal.js/plugin/highlight/highlight.js"></script>
<script src="../src/reveal.js/plugin/notes/notes.js"></script>


<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({
plugins: [RevealHighlight,RevealNotes],
hash: true, transition: 'fade',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
]
});


</script>
</body>
</html>
